print("Ти знайшов пляшку. Відкрити? ")
answer = input()
if answer == "так":
    print("Вилітає Джин.")
    print("Попросити мільйон долларів чи піцу? ")
    answer = input()
    if answer == "мільйон":
        print("Джин дає тобі мільйон долларів. Ти багатий і щасливий!")
    else:
        print("Джин дає тобі піцу. Ти ситий і щасливий!")
else:
    print(
        "Ти розбив пляшку, випустив Джина — він розсердився й зник. Ти залишився ні з чим"
    )
    print("Позаду себе ти бачиш човен. Підійти до нього? ")
    answer = input()
    if answer == "так":
        print("Ти підійшов до човена, але він зламаний. Полагодити? ")
        answer = input()
        if answer == "так":
            print("Ти полагодив човен. Покинути острів? ")
        else:
            print("Ти пішов шукати інший шлях.")
            answer = input()
            if answer == "так":
                print("Ти покинув острів та відправився додому.")

    else:
        print("Ти пішов шукати інший шлях.")
